Q1. Import necessary libraries, defining DB tables as classes and create table in DB with 3 schemas namely sid (int, PK), name(String) and grade (String)

In [285]:
import sqlalchemy
from sqlalchemy import create_engine, Column, Integer, String
from sqlalchemy.orm import sessionmaker, declarative_base

# Initialising engine and session
engine = create_engine('sqlite:///:memory:', echo=True)
Session = sessionmaker(bind=engine)
Session.configure(bind=engine)
session = Session()

In [286]:

Base = declarative_base()

class CLS2122T1(Base):
    __tablename__ = 'TB2103'
    
    # Creating the Table Schema
    sid = Column(Integer, primary_key=True, nullable=False)
    name = Column(String)
    grade = Column(String)
    
    def __repr__(self):
        return "<CLS2122(sid='%s', name='%s', grade='%s')>" %(self.sid, self.name, self.grade)

# Creating the table with the metadata
Base.metadata.create_all(engine)

2021-09-12 18:42:10,414 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2021-09-12 18:42:10,418 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("TB2103")
2021-09-12 18:42:10,418 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-09-12 18:42:10,418 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("TB2103")
2021-09-12 18:42:10,418 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-09-12 18:42:10,418 INFO sqlalchemy.engine.Engine
CREATE TABLE "TB2103" (
	sid INTEGER NOT NULL,
	name VARCHAR,
	grade VARCHAR,
	PRIMARY KEY (sid)
)


2021-09-12 18:42:10,422 INFO sqlalchemy.engine.Engine [no key 0.00047s] ()
2021-09-12 18:42:10,422 INFO sqlalchemy.engine.Engine COMMIT

Q2. Perform the 1st Read operation

In [287]:
# Querying database
q = 'SELECT sid,name,grade from TB2103'
table_exec = engine.execute(q)
data_rows = table_exec.fetchall()
print('sid\t\t\tname\t\t\tgrade')
for row in data_rows:
    print(f'{row[0]}\t\t\t{row[1]}\t\t{row[2]}')
print("Number of Records: ",len(data_rows))

2021-09-12 18:42:10,427 INFO sqlalchemy.engine.Engine SELECT sid,name,grade from TB2103
2021-09-12 18:42:10,427 INFO sqlalchemy.engine.Engine [raw sql] ()
sid			name			grade
Number of Records:  0

Q3. Perform 1st insert operation by adding yourself as student and displaying the updated table

In [288]:
# Performing the Insert Operation
q = 'INSERT INTO TB2103 values(2001376, "Koh Huan Yin", "NA")'
insert = engine.execute(q)

2021-09-12 18:42:10,443 INFO sqlalchemy.engine.Engine INSERT INTO TB2103 values(2001376, "Koh Huan Yin", "NA")
2021-09-12 18:42:10,443 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-09-12 18:42:10,443 INFO sqlalchemy.engine.Engine COMMIT

In [289]:
# Querying the database session
q = 'SELECT sid,name,grade from TB2103'
table_exec = engine.execute(q)
data_rows = table_exec.fetchall()
print('sid\t\t\tname\t\t\tgrade')
for row in data_rows:
    print(f'{row[0]}\t\t\t{row[1]}\t\t{row[2]}')
print("Number of Records: ",len(data_rows))
print("Number of Records appended: ", insert.rowcount)

2021-09-12 18:42:10,459 INFO sqlalchemy.engine.Engine SELECT sid,name,grade from TB2103
2021-09-12 18:42:10,459 INFO sqlalchemy.engine.Engine [raw sql] ()
sid			name			grade
2001376			Koh Huan Yin		NA
Number of Records:  1
Number of Records appended:  1

Q4. Perform 2nd and 3rd Insert Operation and display all rows in the latest table

In [290]:
# Inserting multiple objects
my_data = [(2002345, "Sansa Stark", "NA"),
         (2003456, "Jon Snow", "NA")]
q = "INSERT INTO TB2103 values(?,?,?)"
insert_many = engine.execute(q, my_data)

2021-09-12 18:42:10,475 INFO sqlalchemy.engine.Engine INSERT INTO TB2103 values(?,?,?)
2021-09-12 18:42:10,475 INFO sqlalchemy.engine.Engine [raw sql] [(2002345, 'Sansa Stark', 'NA'), (2003456, 'Jon Snow', 'NA')]
2021-09-12 18:42:10,479 INFO sqlalchemy.engine.Engine COMMIT

In [291]:
# Querying the database session
q = 'SELECT sid,name,grade from TB2103'
table_exec = engine.execute(q)
data_rows = table_exec.fetchall()
print('sid\t\t\tname\t\t\tgrade')
for row in data_rows:
    print(f'{row[0]}\t\t\t{row[1]}\t\t{row[2]}')
print("Number of Records: ",len(data_rows))
print("Number of Records appended: ", insert_many.rowcount)

2021-09-12 18:42:10,491 INFO sqlalchemy.engine.Engine SELECT sid,name,grade from TB2103
2021-09-12 18:42:10,495 INFO sqlalchemy.engine.Engine [raw sql] ()
sid			name			grade
2001376			Koh Huan Yin		NA
2002345			Sansa Stark		NA
2003456			Jon Snow		NA
Number of Records:  3
Number of Records appended:  2

Q5. Perform the 1st Update Operation by updating the grade of Jon Snow to A- and display all tables

In [292]:
# Updating Jon Snow by Query
q = "UPDATE TB2103 SET grade='A-' WHERE sid=2003456"
update = engine.execute(q)

2021-09-12 18:42:10,507 INFO sqlalchemy.engine.Engine UPDATE TB2103 SET grade='A-' WHERE sid=2003456
2021-09-12 18:42:10,507 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-09-12 18:42:10,507 INFO sqlalchemy.engine.Engine COMMIT

In [293]:
# Querying the database session
q = 'SELECT sid,name,grade from TB2103'
table_exec = engine.execute(q)
data_rows = table_exec.fetchall()
print('sid\t\t\tname\t\t\tgrade')
for row in data_rows:
    print(f'{row[0]}\t\t\t{row[1]}\t\t{row[2]}')
print("Number of Records: ",len(data_rows))
print("Rows updated: ", update.rowcount)

2021-09-12 18:42:10,523 INFO sqlalchemy.engine.Engine SELECT sid,name,grade from TB2103
2021-09-12 18:42:10,523 INFO sqlalchemy.engine.Engine [raw sql] ()
sid			name			grade
2001376			Koh Huan Yin		NA
2002345			Sansa Stark		NA
2003456			Jon Snow		A-
Number of Records:  3
Rows updated:  1

Q6. Perform 2nd Update Operation by updating grade of yourself to A+ and display all grades on the table

In [294]:
q = "UPDATE TB2103 SET grade='A+' WHERE sid=2001376"
update = engine.execute(q)

2021-09-12 18:42:10,535 INFO sqlalchemy.engine.Engine UPDATE TB2103 SET grade='A+' WHERE sid=2001376
2021-09-12 18:42:10,539 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-09-12 18:42:10,539 INFO sqlalchemy.engine.Engine COMMIT

In [295]:
# Querying the database session
q = 'SELECT sid,name,grade from TB2103'
table_exec = engine.execute(q)
data_rows = table_exec.fetchall()
print('sid\t\t\tname\t\t\tgrade')
for row in data_rows:
    print(f'{row[0]}\t\t\t{row[1]}\t\t{row[2]}')
print("Number of Records: ",len(data_rows))
print("Rows updated: ", update.rowcount)

2021-09-12 18:42:10,551 INFO sqlalchemy.engine.Engine SELECT sid,name,grade from TB2103
2021-09-12 18:42:10,555 INFO sqlalchemy.engine.Engine [raw sql] ()
sid			name			grade
2001376			Koh Huan Yin		A+
2002345			Sansa Stark		NA
2003456			Jon Snow		A-
Number of Records:  3
Rows updated:  1

Q7. Perform 1st Delete Operation by deleting student Sansa Stark and displaying the table

In [296]:
# Deleting Sansa by Query
q = "DELETE FROM TB2103 WHERE sid=2002345"
delete = engine.execute(q)

2021-09-12 18:42:10,567 INFO sqlalchemy.engine.Engine DELETE FROM TB2103 WHERE sid=2002345
2021-09-12 18:42:10,571 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-09-12 18:42:10,571 INFO sqlalchemy.engine.Engine COMMIT

In [297]:
# Querying the database session
q = 'SELECT sid,name,grade from TB2103'
table_exec = engine.execute(q)
data_rows = table_exec.fetchall()
print('sid\t\t\tname\t\t\tgrade')
for row in data_rows:
    print(f'{row[0]}\t\t\t{row[1]}\t\t{row[2]}')
print("Number of Records: ",len(data_rows))
print("Rows deleted: ", delete.rowcount)

2021-09-12 18:42:10,587 INFO sqlalchemy.engine.Engine SELECT sid,name,grade from TB2103
2021-09-12 18:42:10,587 INFO sqlalchemy.engine.Engine [raw sql] ()
sid			name			grade
2001376			Koh Huan Yin		A+
2003456			Jon Snow		A-
Number of Records:  2
Rows deleted:  1

Q8. Perform 2nd Delete Operation by deleting all students in the table and displaying it

In [298]:
query = 'DELETE FROM TB2103'
delete_all= engine.execute(query)

2021-09-12 18:42:10,599 INFO sqlalchemy.engine.Engine DELETE FROM TB2103
2021-09-12 18:42:10,603 INFO sqlalchemy.engine.Engine [raw sql] ()
2021-09-12 18:42:10,603 INFO sqlalchemy.engine.Engine COMMIT

In [299]:
# Querying the database session
q = 'SELECT sid,name,grade from TB2103'
table_exec = engine.execute(q)
data_rows = table_exec.fetchall()
print('sid\t\t\tname\t\t\tgrade')
for row in data_rows:
    print(f'{row[0]}\t\t\t{row[1]}\t\t{row[2]}')
print("Number of Records: ",len(data_rows))
print("Rows deleted: ", delete_all.rowcount)

2021-09-12 18:42:10,617 INFO sqlalchemy.engine.Engine SELECT sid,name,grade from TB2103
2021-09-12 18:42:10,617 INFO sqlalchemy.engine.Engine [raw sql] ()
sid			name			grade
Number of Records:  0
Rows deleted:  2